[
	{
		"id": "1",
		"title": "Portfolio Architecte",
		"cover": "https://i.goopics.net/omgr45.png",
		"pictures": "https://i.goopics.net/q6u35x.jpg",
		"github" : "https://github.com/elodiechgr/portfolio-architecte.git",
		"description": "Développement d'une page web dynamique en JavaScript avec trois missions clés : premièrement, créer une page de présentation des travaux de l'architecte en utilisant un HTML existant ; deuxièmement, concevoir une page de connexion pour l'administrateur (client) à partir de zéro ; et troisièmement, mettre en place une modale permettant le téléchargement de nouveaux médias, entièrement développée à partir de zéro.",
		"competences": ["HTML", "CSS", "Javascript"],
		"enjeux" : "La difficulté de ce projet résidait dans l'importation dynamique des éléments via Javascript et la création de la modale avec une logique d'ajout de fichiers sans rechargement de la page. L'utilisation d'écouteurs d'événements à permis de surmonter cette difficulté."
	  },

	  {
		"id": "2",
		"title": "Pink Snake",
		"cover": "https://i.goopics.net/q9sqoq.gif",
		"pictures": "https://i.goopics.net/uju66k.jpg",
		"github" : "https://github.com/elodiechgr/pink-snake",
		"description": "J'ai souhaité développer une version différente de l'emblématique jeu Snake, c'est pourquoi je me suis lancé dans le développement d'une interprétation originale du jeu en optant pour une esthétique aux tons pastels.",
		"competences": ["Javascript", "HTML", "CSS"],
		"enjeux" : "Le développement de cette version de Snake a impliqué la création d'un mouvement fluide et naturel pour le serpent, tout en établissant des contraintes de jeu stimulantes pour maintenir l'intérêt du joueur. Cela a nécessité la mise en place de contrôles réactifs et intuitifs ainsi que la définition de limites de jeu claires, tout en préservant une sensation de liberté pour le serpent."
	  },

	{
		"id": "3",
		"title": "Trip booker",
		"cover": "https://i.goopics.net/9chjy3.png",
		"pictures": "https://i.goopics.net/2ddwwp.jpg",
		"github" : "https://github.com/elodiechgr/booki.git",
		"description": " L'objectif est de développer un site Internet pour permettre aux utilisateurs de trouver des hébergements et des activités dans la ville de leur choix. Ma responsabilité consiste à intégrer l'interface du site en utilisant du code HTML et CSS.",
		"competences": ["HTML", "CSS"],
		"enjeux" : "La problématique majeure de ce projet résidait dans l'intégration précise de la maquette, nécessitant une attention minutieuse aux détails. Ma réussite dans cette tâche découle de ma rigueur à suivre scrupuleusement les indications fournies dans la maquette Figma."
	  },

	  {
		"id": "4",
		"title": "My Kasa",
		"cover": "https://i.goopics.net/swnwtm.png",
		"pictures": "https://i.goopics.net/ic871v.jpg",
		"github" : "https://github.com/elodiechgr/kasa.git",
		"description": "L'objectif est de développer une application web de location immobilière en utilisant React. Les tâches comprennent l'initialisation du projet, la conception et l'implémentation des composants React en suivant les maquettes Figma, l'intégration des routes avec React Router, ainsi que l'adaptation du design pour assurer une expérience responsive sur diverses plateformes.",
		"competences": ["HTML", "Javascript", "React", "SCSS"],
		"enjeux" : "La problématique centrale de ce projet résidait dans la maîtrise de React et de sa logique de composants modulaires. J'ai abordé cette difficulté en réfléchissant minutieusement à l'utilisation de chaque composant avant de les créer, garantissant ainsi une structure logique et solide dans l'application."
	  },

	  {
		"id": "5",
		"title": "Biblio Notes",
		"cover": "https://i.goopics.net/v9s996.png",
		"pictures": "https://i.goopics.net/lulcpd.jpg",
		"github" : "https://github.com/elodiechgr/mon-vieux-grimoire.git",
		"description": " L'objectif est de mettre en place le back-end d'un site de notation de livres en utilisant Express. Les tâches incluent la création d'une API RESTful pour gérer l'ajout de notations et calculer la note moyenne d'un livre, l'implémentation d'un système d'authentification pour sécuriser l'application, ainsi que l'intégration d'une gestion des fichiers utilisateur permettant d'ajouter des médias liés aux livres.",
		"competences": ["Node.js", "MongoDB", "Javascript"],
		"enjeux" : "Dans ce projet, l'adhésion aux principes du green code était un aspect essentiel. J'ai donc pris soin d'adopter des pratiques et des méthodologies qui favorisent l'efficacité et la durabilité du code. Cette approche m'a permis de concevoir une solution robuste et économe en ressources, tout en garantissant une performance optimale de l'application."
	  },

	  {
		"id": "6",
		"title": "Portfolio Photographe",
		"cover": "https://i.goopics.net/zikaim.png",
		"pictures": "",
		"github" : "https://github.com/elodiechgr/site-photographe.git",
		"description": "L'objectif était de déboguer et d'optimiser un site de photographe en réalisant des améliorations globales des performances et du référencement SEO. Les tâches incluent la mise en place du référencement local à l'aide de Schema.org pour renforcer la visibilité géographique, l'ajout de métadonnées nécessaires pour les réseaux sociaux afin de favoriser le partage et l'interaction, ainsi que des modifications en matière d'accessibilité pour garantir une expérience inclusive. En outre, il est nécessaire de corriger les bugs dans le code pour assurer un fonctionnement fluide du site. Enfin, j'ai envoyé un rapport d'optimisation détaillé exposant toutes les actions entreprises et leur impact sur le site.",
		"competences": ["SEO", "HTML", "CSS", "Javascript"],
		"enjeux" : "Dans ce projet, l'enjeu majeur résidait dans l'optimisation des scores Lighthouse pour chaque aspect du site, en visant à dépasser les 90 points requis. Pour répondre à cette exigence, j'ai adopté différentes stratégies, parmi lesquelles la compression des images a joué un rôle clé. Cette mesure a permis de réduire la taille des fichiers et d'améliorer significativement les performances du site, contribuant ainsi à l'atteinte de l'objectif fixé."
	  },

	  {
		"id": "8",
		"title": "My Classy Pods",
		"cover": "https://i.goopics.net/tz5k7o.png",
		"pictures": "https://i.goopics.net/luw6yr.png",
		"description": "Ma mission était de personnaliser le thème Shopify pour refléter fidèlement l'identité de la marque, en intégrant des fonctionnalités de paiement sécurisées pour les transactions en ligne. J'ai également optimisé la boutique pour le référencement (SEO) afin d'augmenter sa visibilité en ligne, tout en créant une navigation intuitive et conviviale pour les visiteurs du site.",
		"competences": ["Shopify", "HTML", "CSS", "Javascript"],
		"enjeux" : "Dans ce projet, il a fallu concilier l'esthétique de la marque avec la fonctionnalité du site. Pour cela, j'ai personnalisé le thème Shopify en accordant une attention particulière aux détails pour refléter son identité distincte. Ensuite, j'ai intégré des fonctionnalités de paiement sécurisées pour garantir la confiance des clients lors des transactions en ligne."
	  },

	  {
		"id": "7",
		"title": "Smart Capsule",
		"cover": "https://i.goopics.net/4z861q.png",
		"pictures": "https://i.goopics.net/uwhk0p.png",
		"description": "Ma mission était de créer une expérience en ligne distinctive pour la marque, en concevant un design sur mesure qui reflète parfaitement son esthétique. J'ai également créé, configuré et personnalisé la boutique en ligne Shopify pour répondre précisément aux besoins du client, en m'assurant de former l'équipe à la gestion de la boutique en ligne pour un fonctionnement autonome et efficace.",
		"competences": ["Shopify", "HTML", "CSS", "Javascript"],
		"enjeux" : "Dans ce projet, j'ai dû concilier l'esthétique unique de la marque avec les fonctionnalités d'une boutique en ligne performante. Pour cela, j'ai collaboré étroitement avec le client pour concevoir un design sur mesure tout en maintenant une fonctionnalité optimale. J'ai utilisé mes compétences techniques pour configurer et personnaliser Shopify selon les exigences du client, garantissant ainsi une expérience utilisateur fluide."
	  }
]
